SMP_OnlineExchange/src/Catalogs/СМП_УчетныеЗаписиОбменов/СМП_УчетныеЗаписиОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СМП_УчетныеЗаписиОбменов</name>
  <attributes>
    <name>АлгоритмПередЗагрузкойДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередКонвертациейОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередПолучениемИзмененныхОбъектов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиПараметров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриПолученииИнформацииОбУдалении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КомИмяИнформационнойБазыНаСервере1СПредприятия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомИмяСервера1СПредприятия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОбмена</name>
    <type>
      <types>EnumRef.СМП_НастройкиОбменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СМП_ВидыТранспортовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКаталогОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХттпСервисАдресПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВыгружаемыхДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыКВыгрузке</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаОтбор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СКДДляОтборов</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SMP_OnlineExchange/src/Catalogs/СМП_УчетныеЗаписиОбменов/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Помещает СКД для выбранных документов в ТЧ объекта.
//
// Параметры:
//   КоллекцияСКД - Структура - содержит адреса временных хранилищ СКД для выбранных документов.
//
Процедура ПоместитьСКДВТабЧасть(КоллекцияСКД) Экспорт
	
	Для Каждого СтрокаТЧ Из ОбъектыКВыгрузке Цикл
		
		АдресСхемыКД = Неопределено;
		КоллекцияСКД.Свойство(СтрокаТЧ.ИмяОбъекта, АдресСхемыКД);
		Если ЭтоАдресВременногоХранилища(АдресСхемыКД) Тогда
			
			СКД = ПолучитьИзВременногоХранилища(АдресСхемыКД);
			Если СКД <> Неопределено Тогда
				
				ХранилищеСхемы = Новый ХранилищеЗначения(СКД);
				СтрокаТЧ.СКДДляотборов = ХранилищеСхемы;
				
			Иначе
				
				СтрокаТЧ.СКДДляОтборов = Неопределено;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ПоместитьСКДВТабЧасть

// Получает СКД из таб. части и помещает их во временные хранилища.
//
// Параметры:
//   КоллекцияОбъектовНаФорме - ТаблицаЗначений - реквизит формы "ОбъектыКВыгрузкеНаФорме".
//   КоллекцияСКД - Структура - предназначена для хранения аресов временных хранилищ схем КД выбранных документов.
//   ИдентификаторФормы - УникальныйИдентификатор - идентификатор формы для привязки временных хранилищ.
//
Процедура ПолучитьСКДИзТабЧасти(КоллекцияОбъектовНаФорме, КоллекцияСКД, ИдентификаторФормы) Экспорт
	
	Для Каждого СтрокаТЧ Из ОбъектыКВыгрузке Цикл
		ИскомаяСтр = КоллекцияОбъектовНаФорме.Найти(СтрокаТЧ.ПолноеИмяОбъекта, "ПолноеИмяОбъекта");
		Если ИскомаяСтр <> Неопределено Тогда
			ИскомаяСтр.Пометка = Истина;
			
			СКД = СтрокаТЧ.СкдДляОтборов.Получить();
			Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда
				АдресСхемыКД = ПоместитьВоВременноеХранилище(СКД, ИдентификаторФормы);
				КоллекцияСКД.Вставить(СтрокаТЧ.ИмяОбъекта, АдресСхемыКД);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ПолучитьСКДИзТабЧасти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НастройкаОбмена = Перечисления.СМП_НастройкиОбменов.ДляОтправки Тогда
		индИсточник = ПроверяемыеРеквизиты.Найти("Источник");
		ПроверяемыеРеквизиты.Удалить(индИсточник);
	КонецЕсли;
	
	ПроверитьИдентификаторОбмена(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Временно:
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет проверку корректности идентификатора обмена.
//
// Параметры:
//   Отказ - Булево 
//
Процедура ПроверитьИдентификаторОбмена(Отказ) 
	
	СтрокаЦифр = "1234567890";
	СтрокаБукв = "abcdefghijklmnopqrstuvwxyz";
	
	идДлина = СтрДлина(ИдентификаторОбмена);
	нн = 1;
	Пока нн <= идДлина Цикл
		нБуква = Сред(ИдентификаторОбмена, нн, 1);
		Если СтрНайти(СтрокаЦифр, нБуква) = 0 И СтрНайти(СтрокаБукв, НРег(нБуква)) = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Допускаются только цифры и буквы латинского алфавита!",, "ИдентификаторОбмена", "Объект", Отказ);
			Прервать;
		КонецЕсли;
		нн = нн + 1;
	КонецЦикла;
	
КонецПроцедуры //ПроверитьИдентификаторОбмена

#КонецОбласти
